turbulent_wedge/turbulent_wedge_kE/turbulent_wedge_kE_HRN_WF/turbulent_wedge_kE_HRN_WF_low_l/system/extrudeMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      extrudeMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// What to extrude:
//      patch   : from patch of another case ('sourceCase')
//      mesh    : as above but with original case included
//      surface : from externally read surface

//constructFrom mesh;
constructFrom patch;

// If construct from patch/mesh:
sourceCase ".";
sourcePatches (front);

// If construct from patch: patch to use for back (can be same as sourcePatch)
exposedPatchName back;

// Flip surface normals before usage. Valid only for extrude from surface or
// patch.
flipNormals false;

//- Wedge extrusion of a single layer
//  with wedge patches on front and back
extrudeModel        wedge;

sectorCoeffs
{
    axisPt      (0 0 0.1);
    axis        (1 0 0);
    angle       2;  // wedge assumes axial symmetry of angle/2 on each side
}

// Do front and back need to be merged? Usually only makes sense for 360
// degree wedges.
mergeFaces false;

// Merge small edges. Fraction of bounding box.
//mergeTol 1e-6;	//0;

//If you have many cells in the radial direction increase the writing precision in controlDict

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
