turbulent_wedge/turbulent_wedge_kE/turbulent_wedge_kE_HRN_WF/turbulent_wedge_kE_HRN_WF_low_l/system/surfacesDict0
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type surfaces;
libs ("libsampling.so");

writeControl writeTime;

surfaceFormat raw;

interpolationScheme cellPoint;

// Fields to sample.
fields
(
   grad(U) U 
);

surfaces
(

   wall
   {
       type patch;
       patches  ("top");
       //interpolate false;
   }

);

// *********************************************************************** //
